In [1]:
import sqlite3

In [2]:
db= sqlite3.connect("Employee.sqlite")
db

In [3]:
cur = db.cursor()
cur

In [4]:
cur.execute("create table employeedetail (employeeid int primary key, names text, age int, department text, salary int)")

In [10]:
values = [(100,"rishav",25,"marketing",50000),(101,"abhishek",26,"operations",60000),(102,"aman",24,"human resource",75000)]

cur.executemany('insert into employeedetail values (?,?,?,?,?)',values)
db.commit()

In [12]:
cur.execute("delete from employeedetail where employeeid = 101")
db.commit()

In [14]:
# delete a row with parameter
id_del=102

cur.execute("delete from employeedetail where employeeid = ?",(id_del,))
db.commit()

In [16]:
# creating a new table in same database

employee_details = [
    (101, 'Aadarsh', 25, 'Marketing', 50000),
    (102, 'Aarti', 27, 'Operations', 60000),
    (103, 'Siddharth', 25, 'Finance', 85000),
    (104, 'Aman', 24, 'Human Resource', 75000),
    (105, 'Amit', 30, 'Marketing', 50000),
    (106, 'Shivansh', 26, 'IT', 90000),
    (107, 'Vaibhav', 23, 'Finance', 85000),
    (108, 'Himanshu', 26, 'IT', 90000),
    (109, 'Raman', 25, 'Operations', 60000),
    (110, 'Kunal', 26, 'Marketing', 50000),
    (111, 'Adhira', 29, 'Human Resource', 75000),
    (112, 'Tanya', 24, 'Marketing', 50000)
]


cur.executemany("insert into employeedetail values (?,?,?,?,?)",employee_details)
db.commit()

In [23]:
#fetching employee details

cur.execute('select employeeid from employeedetail where department = "Finance"')
print(cur)

for i in cur:
    print(i)

<sqlite3.Cursor object at 0x00000177204EE140>
(103,)
(107,)

In [24]:
cur.execute('select employeeid from employeedetail where department = "Finance"')
cur.fetchall()

[(103,), (107,)]

In [25]:
cur.execute("select department,count(*) from employeedetail group by department")
cur.fetchall()

[('Finance', 2),
 ('Human Resource', 2),
 ('IT', 2),
 ('Marketing', 4),
 ('Operations', 2),
 ('marketing', 1)]

In [ ]:
db.close()

In [26]:
# connecting with IMDB.sqlite
import pandas as pd

db = sqlite3.connect("IMDB.sqlite")

In [28]:
df = pd.read_sql_query("select distinct genre from genre",db)
df

        genre
0   Biography
1   Adventure
2      Comedy
3       Drama
4      Action
5   Animation
6       Crime
7     Mystery
8     Romance
9    Thriller
10
11    History
12      Sport
13    Western
14     Sci-Fi
15     Family
16    Musical
17    Fantasy
18        War
19     Horror
20      Music

In [32]:
#we are not storing output in anything
pd.read_sql_query("select genre,count(*) from genre where genre is not null and genre != '' group by genre",db)

        genre  count(*)
0      Action        33
1   Adventure        43
2   Animation        13
3   Biography        21
4      Comedy        31
5       Crime        11
6       Drama        77
7      Family         3
8     Fantasy         7
9     History         6
10     Horror         2
11      Music         3
12    Musical         1
13    Mystery         7
14    Romance        13
15     Sci-Fi        18
16      Sport         3
17   Thriller        14
18        War         2
19    Western         2

In [33]:
#highest grossing movie

pd.read_sql_query("select Movie_id,max(Domestic + Worldwide) from earning",db)

  Movie_id  max(Domestic + Worldwide)
0    38626               3.004886e+09

In [34]:
#using joins

pd.read_sql_query("select earning.Movie_id,max(Domestic + Worldwide),Title from earning join IMDB on earning.Movie_id=IMDB.Movie_id",db)

  Movie_id  max(Domestic + Worldwide)                                Title
0    38626               3.004886e+09  Star Wars: The Force Awakens (2015)